app/views/results/index.html.erb

			<td>
				<% @usr = User.find(result.user_id) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."user_id" IS NULL LIMIT 1