app/controllers/exams_controller.rb

  def index
    @exams = Exam.all
---
SELECT "exams".* FROM "exams"

  def show
    @questions = Question.where(exam_id: @exam.id)
---
SELECT "questions".* FROM "questions"  WHERE "questions"."exam_id" = 1

  def create
    @exam = Exam.new(exam_params)
    @exam.save
---
INSERT INTO "exams" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-11-12 16:34:25.068154"], ["name", "Exam1"], ["updated_at", "2015-11-12 16:34:25.068154"]]

  def destroy
    @exam.destroy
---
DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 1]]

  def result
    @exam = Exam.find(params[:exam_id])
    @correct = session[:correct]
    @total_marks = session[:user_marks]
    @total_possible_marks = session[:total_possible_marks]
    @possible = @@exam_questions.length

    @result = Result.create(exam_id: params[:exam_id],user_id: current_user.id,score: @total_marks,max_score: @total_possible_marks)

    session.clear
    @questions = Question.all
---
SELECT  "exams".* FROM "exams"  WHERE "exams"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "results" ("created_at", "exam_id", "max_score", "score", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-11-14 11:29:37.850825"], ["exam_id", 1], ["max_score", 8], ["score", 6], ["updated_at", "2015-11-14 11:29:37.850825"], ["user_id", 3]]
SELECT "questions".* FROM "questions"

    def set_exam
      @exam = Exam.find(params[:id])
---
SELECT  "exams".* FROM "exams"  WHERE "exams"."id" = ? LIMIT 1  [["id", 1]]