app/controllers/questions_controller.rb

  def index
    @questions = Question.where(exam_id: @exam.id)
---
SELECT "questions".* FROM "questions"  WHERE "questions"."exam_id" = 1

  def create
    @question = Question.new(question_params)
    @question.exam_id = @exam.id
    @question.save
---
INSERT INTO "questions" ("answer", "content", "created_at", "exam_id", "marks", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["answer", "4"], ["content", "What is square of 2?"], ["created_at", "2015-11-13 12:21:02.331717"], ["exam_id", 1], ["marks", 2], ["updated_at", "2015-11-13 12:21:02.331717"]]

    def set_exam
      @exam = Exam.find(params[:exam_id])
---
SELECT  "exams".* FROM "exams"  WHERE "exams"."id" = ? LIMIT 1  [["id", 1]]