app/controllers/results_controller.rb

SELECT "results".* FROM "results"  WHERE "results"."exam_id" = 1  ORDER BY score DESC
---
	def index
		@results = Result.where(exam_id: @exam.id).order('score DESC')

SELECT  "exams".* FROM "exams"  WHERE "exams"."id" = ? LIMIT 1  [["id", 1]]
---
		def set_exam
			@exam = Exam.find(params[:exam_id])